ДО_ПЭС/src/InformationRegisters/ЕАЕ_СоответствиеПредопредОбъектовЗначениямОбъектовБД/ЕАЕ_СоответствиеПредопредОбъектовЗначениямОбъектовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЕАЕ_СоответствиеПредопредОбъектовЗначениямОбъектовБД</name>
  <attributes>
    <name>Значение</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПредопределенныйОбъект</name>
    <type>
      <types>CatalogRef.ЕАЕ_ПредопределенныеЗначенияОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДО_ПЭС/src/CommonModules/ЕАЕ_ОбщегоНазначенияСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции общего назначения

#Область ПрограммныйИнтерфейс

// Функция - Получить ссылку по предопределенному объекту
//
// Параметры:
//  ПредопределенноеЗначениеОбъекта	 - 	СправочникСсылка.ЕАЕ_ПредопределенныеЗначенияОбъектов - ссылка на предопределенный элемент справочника (для отбора)
// 
// Возвращаемое значение:
//   ЛюбаяСсылка,  Неопределено - ссылка на искомые элементы любого типа, удовлетворяющее условиям отбора
//
Функция ПолучитьСсылкуПоПредопределенномуОбъекту(ПредопределенноеЗначениеОбъекта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕАЕ_СоответствиеПредопредОбъектовЗначениямОбъектовБД.Значение
	               |ИЗ
	               |	РегистрСведений.ЕАЕ_СоответствиеПредопредОбъектовЗначениямОбъектовБД КАК ЕАЕ_СоответствиеПредопредОбъектовЗначениямОбъектовБД
	               |ГДЕ
	               |	ЕАЕ_СоответствиеПредопредОбъектовЗначениямОбъектовБД.ПредопределенныйОбъект = &ПредопределенныйОбъект";
	
	Запрос.УстановитьПараметр("ПредопределенныйОбъект", ПредопределенноеЗначениеОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Значение;
			
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
